Repository: rage93/Secuvast-crm
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: Pricing
es: Precios

source: Dashboard
es: Panel

source: Login
es: Iniciar sesión

source: Register
es: Registrarse

source: Manage your business effortlessly
es: Administra tu negocio sin esfuerzo

source: Secuvast CRM helps you track customers, inventory and finances in one place.
es: Secuvast CRM te ayuda a gestionar clientes, inventario y finanzas en un solo lugar.

source: Get started
es: Comenzar

source: All-in-one Dashboard
es: Panel integral

source: Control CRM, ERP and inventory from a single panel.
es: Controla CRM, ERP e inventario desde un solo panel.

source: Secure by design
es: Seguridad desde el diseño

source: Your data stays private within your company.
es: Tus datos permanecen privados dentro de tu empresa.

source: Dedicated support
es: Soporte dedicado

source: We are here to help you succeed.
es: Estamos aquí para ayudarte a triunfar.

source: Who we are
es: Quiénes somos

source: Secuvast is a passionate team building reliable software for growing businesses.
es: Secuvast es un equipo apasionado que crea software confiable para empresas en crecimiento.

source: Ready to streamline your workflow?
es: ¿Listo para simplificar tu trabajo?

source: View Plans
es: Ver planes
